Oprations

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, np.nan, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [3]:
df

   A     B    C
0  1  10.0  100
1  2   NaN  200
2  3  30.0  300
3  4  40.0  400
4  5  50.0  500

In [4]:
df.shape

(5, 3)

In [5]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       4 non-null      float64
 2   C       5 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 252.0 bytes

In [7]:
df.describe()

              A          B           C
count  5.000000   4.000000    5.000000
mean   3.000000  32.500000  300.000000
std    1.581139  17.078251  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  25.000000  200.000000
50%    3.000000  35.000000  300.000000
75%    4.000000  42.500000  400.000000
max    5.000000  50.000000  500.000000

Data Frames Applying Functions

In [8]:
df

   A     B    C
0  1  10.0  100
1  2   NaN  200
2  3  30.0  300
3  4  40.0  400
4  5  50.0  500

In [13]:
def square(x):
    return x**2

df["D"] = df["B"].apply(square)

In [14]:
df

   A       B    C          D
0  1   100.0  100    10000.0
1  2     NaN  200        NaN
2  3   900.0  300   810000.0
3  4  1600.0  400  2560000.0
4  5  2500.0  500  6250000.0